notes_23_04.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-04-23 Mon 19:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Marijan Gradecak" />
<title> Election Algorithms 23/04/2018 </title>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5e0a282">1. Election Algorithms</a>
<ul>
<li><a href="#orgf7c37d6">1.1. Assumptions</a></li>
<li><a href="#org997ebd6">1.2. Chang-Roberts algorithm</a>
<ul>
<li><a href="#org702532b">1.2.1. How it works</a></li>
<li><a href="#orga513bc8">1.2.2. Complexity</a></li>
</ul>
</li>
<li><a href="#org7c0041c">1.3. Franklin Algorithm</a>
<ul>
<li><a href="#org1932554">1.3.1. How it works:</a></li>
<li><a href="#orgd03d6d1">1.3.2. Features</a></li>
<li><a href="#org25dcb0b">1.3.3. Adapting Franklin to directed ring (Dolev-Klawe-Rodeh algorithm):</a></li>
</ul>
</li>
<li><a href="#orged128e2">1.4. Acyclic Networks</a></li>
<li><a href="#orgcd5a5e9">1.5. Echo algorithm (with extinction)</a>
<ul>
<li><a href="#orgc833ae8">1.5.1. Worst case complexity</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7e73701">2. Minimum Spanning Trees (MST)</a>
<ul>
<li><a href="#org9d1e254">2.1. Lemma:</a></li>
<li><a href="#org22a5c8f">2.2. Gallager-Humblet-Spira Algorithm</a>
<ul>
<li><a href="#orge6dbc06">2.2.1. Complications</a></li>
<li><a href="#org561b2c8">2.2.2. Level, name and core edge:</a></li>
<li><a href="#orgf75e66a">2.2.3. Initialisation</a></li>
<li><a href="#org2bfe512">2.2.4. Joining two fragments</a></li>
<li><a href="#orge55aea7">2.2.5. Computing the lowest-weight outgoing edge</a></li>
<li><a href="#org8e3d192">2.2.6. Reporting to core nodes</a></li>
<li><a href="#org0df4fb2">2.2.7. Termination or changeroot at the core nodes</a></li>
<li><a href="#org00ac9a6">2.2.8. <span class="todo TODO">TODO</span> Starting the join of two fragments</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org5e0a282" class="outline-2">
<h2 id="org5e0a282"><span class="section-number-2">1</span> Election Algorithms</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Leader process to coordinate distributed task</li>
<li>Each election computation should <b>terminate</b> in a configuration where <b>1
process</b> is leader</li>
</ul>
</div>
<div id="outline-container-orgf7c37d6" class="outline-3">
<h3 id="orgf7c37d6"><span class="section-number-3">1.1</span> Assumptions</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>The algorithm is <b>decentralised</b></li>
<li>All processes have the same local</li>
<li>Process id's are <b>unique</b> and <b>totally ordered</b></li>
</ul>
</div>
</div>

<div id="outline-container-org997ebd6" class="outline-3">
<h3 id="org997ebd6"><span class="section-number-3">1.2</span> Chang-Roberts algorithm</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Directed ring</li>
<li>only initiators are <b>active</b> and send message with their id's</li>
</ul>
</div>
<div id="outline-container-org702532b" class="outline-4">
<h4 id="org702532b"><span class="section-number-4">1.2.1</span> How it works</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Let active process P receive message Q
</p>
<ul class="org-ul">
<li>if Q &lt; P  : dismisses message</li>
<li>if Q &gt; P  : P becomes <b>passive</b> and passes on the message</li>
<li>if Q == P : P becomes the *leader</li>
</ul>
</div>
</div>
<div id="outline-container-orga513bc8" class="outline-4">
<h4 id="orga513bc8"><span class="section-number-4">1.2.2</span> Complexity</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>Worst case O(N<sup>2</sup>)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7c0041c" class="outline-3">
<h3 id="org7c0041c"><span class="section-number-3">1.3</span> Franklin Algorithm</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Consider <b>Undirected Ring</b></li>
</ul>
</div>
<div id="outline-container-org1932554" class="outline-4">
<h4 id="org1932554"><span class="section-number-4">1.3.1</span> How it works:</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li>Each process P compares its id with id of active neighbours</li>
<li>if a neighbour has a larder id then P becomes passive</li>
<li>Each round an active process P:
<ul class="org-ul">
<li>sends its id to its neighbours</li>
<li>receives ids from Q and R
<ul class="org-ul">
<li>if max(q,r) &lt;</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgd03d6d1" class="outline-4">
<h4 id="orgd03d6d1"><span class="section-number-4">1.3.2</span> Features</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li>Always takes 2 rounds if ID's are <b>sorted</b></li>
<li>for N=4 takes 3 rounds if largest id and second largest are on opposite
sides of ring</li>
</ul>
</div>
</div>

<div id="outline-container-org25dcb0b" class="outline-4">
<h4 id="org25dcb0b"><span class="section-number-4">1.3.3</span> Adapting Franklin to directed ring (Dolev-Klawe-Rodeh algorithm):</h4>
<div class="outline-text-4" id="text-1-3-3">
<ul class="org-ul">
<li>Consider a directed ring</li>
<li>the comparison of an active process P and its nearest active neighbours q
and r is performed at r</li>
<li>&#x2013;&gt; s &#x2013;&gt; q &#x2013;&gt; p &#x2013;&gt; r &#x2013;&gt;t &#x2013;&gt;
<ul class="org-ul">
<li>if max(q,r) &lt; p then r chagnes its id to p and sends out p</li>
<li>if max (q,r) &gt; p r becomes passive</li>
<li>if max(q,r) = p then r announces this id to all processes</li>
<li>the process which originally had the id becomes the leader</li>
</ul></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orged128e2" class="outline-3">
<h3 id="orged128e2"><span class="section-number-3">1.4</span> Acyclic Networks</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Start with <b>wake-up phase</b> driven by initiators
<ul class="org-ul">
<li>initially, initiators send wake up messages to neighbours</li>
<li>when non-init receives first wake up message sends wake-up message to neighbours</li>
</ul></li>

<li>P waits until it has received ID from all neighbours except 1</li>
<li>P computes max(ID) from its received ID and its own</li>
<li>P sends a parent request to its parent tagged with max<sub>p</sub> (max id of subnet)</li>
<li>if p recieves a parent request from its parent, tagged with q it computes
max'<sub>p</sub> being the maximum of max<sub>p</sub> and q</li>
<li>next p sends an info message to all neighburs except parent tagged with max'<sub>p</sub></li>
<li>info message is forwarded to network</li>
<li>process with max'<sub>p</sub> is the <b>leader</b></li>
</ul>
</div>
</div>
<div id="outline-container-orgcd5a5e9" class="outline-3">
<h3 id="orgcd5a5e9"><span class="section-number-3">1.5</span> Echo algorithm (with extinction)</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>each initiator starts a wave, tagged with its id</li>
<li>non initiators join first wave that hits them</li>
<li>if a process p in wave q is hit by wave r
<ul class="org-ul">
<li>if q &lt; r then p changes to wave r</li>
<li>if q &gt; r then p continues with wave q</li>
<li>if q = r then incoming msg is treated according to regular echo algorithm</li>
</ul></li>
</ul>
</div>

<div id="outline-container-orgc833ae8" class="outline-4">
<h4 id="orgc833ae8"><span class="section-number-4">1.5.1</span> Worst case complexity</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
O(N * E)
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org7e73701" class="outline-2">
<h2 id="org7e73701"><span class="section-number-2">2</span> Minimum Spanning Trees (MST)</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Consider an <b>undirected</b>, <b>weighted</b> network.</li>
<li>In the MST the sum of the weights of the edges in the spanning tree is minimal</li>
</ul>
</div>

<div id="outline-container-org9d1e254" class="outline-3">
<h3 id="org9d1e254"><span class="section-number-3">2.1</span> Lemma:</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>let F be a <b>fragment</b> (a connected subgraph of the MST M)</li>
<li>let e be the <i>lowest weight</i> <b>outgoing</b> edge of F (e has exactly one endpoint F)</li>
<li>then e is in M</li>
</ul>
<ul class="org-ul">
<li>M U {e} has a cycle containing e and another oudgoing edge f of F</li>
<li>Replacing f by e in M gives a spanning tree</li>
</ul>
</div>
</div>

<div id="outline-container-org22a5c8f" class="outline-3">
<h3 id="org22a5c8f"><span class="section-number-3">2.2</span> Gallager-Humblet-Spira Algorithm</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Consider <b>undirected</b>, <b>weighted</b> network

<ul class="org-ul">
<li>Initially, each process forms a separate fragment</li>
<li>the processes in fragment F together search for the lowest-weight
outgoing edge e<sub>F</sub></li>
<li>when e<sub>F</sub> has been found, the fragment at the other end is asked to
collaborate in merge</li>
</ul></li>
</ul>
</div>

<div id="outline-container-orge6dbc06" class="outline-4">
<h4 id="orge6dbc06"><span class="section-number-4">2.2.1</span> Complications</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li>is the edge outgoing?</li>
<li>is it the lowest-weight</li>
</ul>
</div>
</div>

<div id="outline-container-org561b2c8" class="outline-4">
<h4 id="org561b2c8"><span class="section-number-4">2.2.2</span> Level, name and core edge:</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Each fragment carries a (unique) <b>name</b> fn : R and a <b>level</b> l : N
</p>

<p>
its level is the maximum number of joins any process in the fragment has
experienced
</p>

<ul class="org-ul">
<li>Neighbouring fragments \(F = (fn,l)\) and \(F'=(fn', l')\) can be joined as
follows:</li>
</ul>

<p>
\(l<l' ^ F--e_F-->F': F U F' = (fn', l)\) <br />
\(l = l' ^ e_F = e_F': F U F' = weight(e_F, l+1\)
</p>

<ul class="org-ul">
<li>Paramaters of a process:
<ul class="org-ul">
<li><b>sleep</b> (for noninitiators)</li>
<li><b>find</b> (looking for lowest-weight outgoing edge)</li>
<li><b>found</b> (reported a lowest-weight outgoing edge to core edge)</li>
</ul></li>

<li>Status of a channel:
<ul class="org-ul">
<li><b>basic edge</b> (undecided)</li>
<li><b>branch edge</b> (in the spanning tree)</li>
<li></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf75e66a" class="outline-4">
<h4 id="orgf75e66a"><span class="section-number-4">2.2.3</span> Initialisation</h4>
<div class="outline-text-4" id="text-2-2-3">
<ul class="org-ul">
<li>Non-initiators  wake up when they recieve a (<b>connect</b> or <b>test</b>) msg</li>

<li>Each initiator and non-initiator</li>
</ul>
</div>
</div>

<div id="outline-container-org2bfe512" class="outline-4">
<h4 id="org2bfe512"><span class="section-number-4">2.2.4</span> Joining two fragments</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
Let fragments \(F = (fn,l)\) and \(F'=(fn', l')\) be joined ia channel \(pq\)
</p>

<ul class="org-ul">
<li>if \(l < l'\) then p sent &lt;connect, l&gt; to q
<ul class="org-ul">
<li>q sends \(<initiate, fn', l', find/found>\) to p</li>
<li>\(F U F'\) inherits the core edge of F'</li>
</ul></li>

<li>if \(l == l'\) then p and q sent \(<connect,l>\) to each other
<ul class="org-ul">
<li>They send $&lt;initiate, weight pq, l+1, find&gt; to each other</li>
<li>\(F U F'\) gets core edge pq</li>
</ul></li>

<li>At the reception of $&lt;initiate, fn, l, find/found&gt; a process stores fn and
l sets its state to find or found and adopts the sender as its <b>parent</b></li>

<li>it passes on the message through its other <b>branch</b> edges</li>
</ul>
</div>
</div>

<div id="outline-container-orge55aea7" class="outline-4">
<h4 id="orge55aea7"><span class="section-number-4">2.2.5</span> Computing the lowest-weight outgoing edge</h4>
<div class="outline-text-4" id="text-2-2-5">
<ul class="org-ul">
<li>In the case of $&lt;initiate, fn, l, find&gt; p checks in increasing order of
weight if one of its basic eges pq is outgoing, by sending &lt;test, fn, l&gt; to
q</li>
<li>while \(l > level_q\) q postpones processing the incoming <b>test</b> message</li>

<li>let \(l <= level_q\)
<ul class="org-ul">
<li>if q is in fragment fn, then q replies reject in this case p and q will set pq to rejected</li>
<li>Else q replies accept</li>
</ul></li>

<li>When a basic edge is accepted, or there are no basic edges left p stops the
search</li>
</ul>
</div>
</div>
<div id="outline-container-org8e3d192" class="outline-4">
<h4 id="org8e3d192"><span class="section-number-4">2.2.6</span> Reporting to core nodes</h4>
<div class="outline-text-4" id="text-2-2-6">
<ul class="org-ul">
<li>p waits for all its branch edges, except its parent, to report</li>
<li>p sets its state to found</li>
<li>p computes the minimum &lambda; of (1) these reports, and (2) the weight of
its lowest-weight outgoing basic edge (or &infin; if no such channel is found)</li>

<li>if \(\lambda < \infty\) p stores either branch edge that sent &lambda; or &#x2026;</li>
</ul>
</div>
</div>

<div id="outline-container-org0df4fb2" class="outline-4">
<h4 id="org0df4fb2"><span class="section-number-4">2.2.7</span> Termination or changeroot at the core nodes</h4>
<div class="outline-text-4" id="text-2-2-7">
<p>
a core node recieves reports throguh all its branch edges including the core edge
</p>
<ul class="org-ul">
<li>if the min reported value u = &infin;, the core nodes terminate</li>
<li>if u &lt; &infin; the core node that recieved u first sends chngeroot
towards the lowest-weight ougoing basic edge</li>
<li>The core edge becomes regular tree edge</li>

<li>Ultimately changeroot reaches the process p that reported the lowest-weight</li>
</ul>
</div>
</div>


<div id="outline-container-org00ac9a6" class="outline-4">
<h4 id="org00ac9a6"><span class="section-number-4">2.2.8</span> <span class="todo TODO">TODO</span> Starting the join of two fragments</h4>
<div class="outline-text-4" id="text-2-2-8">
<ul class="org-ul">
<li>when q receives \(<connect, level_p>\) from p, \(level_q >= level_p\)
<ul class="org-ul">
<li>namely either level<sub>p</sub> =0 or q earlier sent <b>accept</b> to p</li>
</ul></li>

<li>if \(level_q > level_p\) then q sets qp to <b>branch</b> and sends
<ul class="org-ul">
<li>&lt;initiate, name<sub>q</sub>, level<sub>q</sub>, $find/found$&gt; to p</li>
</ul></li>
<li>as long as level<sub>q</sub> == level<sub>p</sub> and <b>qp isnt a branch edge</b> q postpones
processing the connect msg</li>

<li>if level<sub>q</sub> = level<sub>p</sub> and qp is a branch edge (meaning that q sent
&lt;connect, level<sub>q</sub>&gt; to p) then q sends &lt;initiate, weight qp, level<sub>q</sub> + 1,
find&gt; to p (and vice versa)</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Marijan Gradecak</p>
<p class="date">Created: 2018-04-23 Mon 19:42</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
